package ir.amirrezaanari.barandehplanning.onboarding

import ir.amirrezaanari.barandehplanning.R

data class OnboardingPage(
    val image: Int,
    val title: String,
    val description: String
)

val pages = listOf(
    OnboardingPage(
        image = R.drawable.icon,
        title = "به دنیای هوشمند برنامه‌ریزی خوش‌آمدید!",
        description = "اولین نرم‌افزاری که با ترکیب هوش‌مصنوعی پیشرفته و روش‌شناسی منحصربه‌فرد، برنامه‌های شما را نه‌تنها سازماندهی می‌کند، بلکه همزمان با شما یاد می‌گیرد و برای رسیدن به بهترین نسخه از خودتان، راهکارهای شخصی‌سازی‌شده ارائه می‌دهد!"
    ),
    OnboardingPage(
        image = R.drawable.boarding_planning,
        title = "برنامه‌ریزی دوطرفه؛ هم نقشه، هم نتیجه!",
        description = "اینجا فقط لیست کارهایتان را نمی‌نویسید!\n✔ بخش برنامه‌های پیشرو (اهداف + زمان‌بندی)\n✔ بخش دستاوردهای ثبت‌شده (پیشرفت واقعی + تحلیل آماری)\nبا مقایسه هوشمندانه این دو، اشتباهات برنامه‌ریزی خود را به داده‌های طلایی تبدیل کنید!"
    ),
    OnboardingPage(
        image = R.drawable.boarding_ai,
        title = "مشاور خصوصی شما در جیبتان!",
        description = "هوش‌مصنوعی «برنده» مانند یک کوچ حرفه‌ای:\n▸ برنامه‌هایتان را با الگوریتم‌های پیش‌بینی کننده تحلیل می‌کند\n▸ به سوالاتی مثل «چرا همیشه این برنامه عقب می‌افتد؟» پاسخ علمی می‌دهد\n▸ راهکارهای عملیاتی پیشنهاد می‌دهد تا برنامه‌ها از روی کاغذ به واقعیت تبدیل شوند!"
    ),
    OnboardingPage(
        image = R.drawable.boarding_victory,
        title = "حالا نوبت پیروزی شماست!",
        description = "هر روز یک گام به رویاهایتان نزدیک‌تر شوید.\nبا «برنده»:\n✓ اشتباهات گذشته را به تجربه‌های آینده تبدیل کنید\n✓ زمانتان را مثل سوخت موشک مدیریت کنید\n✓ هوشمندی را جایگزین سعی‌وخطا کنید! \n \n ساخته شده توسط امیررضا اناری از هنرستان سمپاد بیرجند"
    )
)